In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
lst=[1,2,3,3,4,5,6]

In [4]:
s=pd.Series(lst)

print(s,type(s))

0    1
1    2
2    3
3    3
4    4
5    5
6    6
dtype: int64 <class 'pandas.core.series.Series'>

In [5]:
#we can use sequential data , list type data , dictionaries for the Series representation, but not sets, why? cause they arent ordered.

In [6]:
# s=pd.Series(object,index,dtype)

# here : object maybe a list , dictionary , int value etc.
# index : is user defined index, if not default value starts from 0.

In [7]:
lst=[10,"python","S","python for Data Scientists"]

In [8]:
s=pd.Series(lst,["eno","sub","grade","course"])

print(s,type(s))

eno                               10
sub                           python
grade                              S
course    python for Data Scientists
dtype: object <class 'pandas.core.series.Series'>

In [9]:
s[::-1]

course    python for Data Scientists
grade                              S
sub                           python
eno                               10
dtype: object

In [10]:
# this series representation is mutable, can be sliced and indexed as well.

In [11]:
#now for dataframes.

In [12]:
# dataframe is the collection of rows, colums and datasets. 

# syntax : var_name=pd.DataFrame(lst,[10,20,30,40],["roll","names"])

In [24]:
lst=[[10,20,30,40],["hazard","neymar","ronaldo","messi"]]

In [25]:
df=pd.DataFrame(lst)

In [26]:
print(df,type(df))

        0       1        2      3
0      10      20       30     40
1  hazard  neymar  ronaldo  messi <class 'pandas.core.frame.DataFrame'>

In [17]:
lst={10:"hazard",20:"neymar",30:"ronaldo",40:"messi"}

In [27]:
df[1]

0        20
1    neymar
Name: 1, dtype: object

In [22]:
print(df,type(df))

  trophies player
1      NaN    NaN
2      NaN    NaN
3      NaN    NaN
4      NaN    NaN <class 'pandas.core.frame.DataFrame'>

In [28]:
lst=[["sbi",7.5,7.6,7.7],["icici",6.5,6.9,7.8],["Hdfc",11.4,11.5,9.5]]

In [30]:
df=pd.DataFrame(lst,columns=["Bname","Edu_loan","Personal_loan","Home_loan"])

In [31]:
print(df)

   Bname  Edu_loan  Personal_loan  Home_loan
0    sbi       7.5            7.6        7.7
1  icici       6.5            6.9        7.8
2   Hdfc      11.4           11.5        9.5

In [32]:
df.set_index("Bname")

       Edu_loan  Personal_loan  Home_loan
Bname
sbi         7.5            7.6        7.7
icici       6.5            6.9        7.8
Hdfc       11.4           11.5        9.5

In [33]:
df["Bname"]

0      sbi
1    icici
2     Hdfc
Name: Bname, dtype: object

In [36]:
df

   Bname  Edu_loan  Personal_loan  Home_loan
0    sbi       7.5            7.6        7.7
1  icici       6.5            6.9        7.8
2   Hdfc      11.4           11.5        9.5

In [37]:
a={10,20,30,40,50}

b1=np.array(a)

In [39]:
df=pd.Series(b1)

In [40]:
df

0    {50, 20, 40, 10, 30}
dtype: object

In [41]:
DF=pd.DataFrame(df)

In [42]:
DF

                      0
0  {50, 20, 40, 10, 30}

In [43]:
#working with CSV's 

# main thing : to work with CSV's we will use : df=pd.read_csv(file_path)

In [45]:
df=pd.read_csv("C:/Users/HARSHA/miniconda3/Lib/site-packages/numpy/random/tests/data/pcg64-testset-2.csv")

In [46]:
df

     seed                  0x0
0       0   0xa30febcfd9c2825f
1       1   0x4510bdf882d9d721
2       2    0xa7d3da94ecde8b8
3       3    0x43b27b61342f01d
4       4   0xd0327a782cde513b
..    ...                  ...
995   995   0xdb575260935d51d5
996   996   0x13fb4bfbbc0d7b53
997   997   0x62213850186bb92b
998   998   0x2a34823312c00388
999   999   0x6148329042f743b0

[1000 rows x 2 columns]